InformationRegisters/ОтветственныеЗаОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЗаОперации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаВидовОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВидовОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЗаОперации/Ext/ManagerModule.bsl
Функция Используется(Организация, ВидОперации, ЦельРасчета, ДатаОперации) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаОперации",	ДатаОперации);
	Запрос.УстановитьПараметр("ЦельРасчета",	?(ЦельРасчета = Неопределено, Справочники.ЦелиРасчета.ПустаяСсылка(), ЦельРасчета));
	
	Если Метаданные.Документы.Найти(ВидОперации) <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперации", Документы[ВидОперации].ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса_Используется();
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ТекстЗапроса_Используется()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОтветственныеЗаОперации.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ВидыОперацийГруппы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|			ПО (ГруппыВидовОпераций.Ссылка = ВидыОперацийГруппы.Ссылка)
		|				И (ГруппыВидовОпераций.ПометкаУдаления = ЛОЖЬ)
		|		ПО (ВидыОперацийГруппы.Ссылка = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|			И (ВидыОперацийГруппы.ВидОперации = &ВидОперации)
		|			И (ВидыОперацийГруппы.ЦельРасчета = &ЦельРасчета)
		|ГДЕ
		|	ОтветственныеЗаОперации.Организация = &Организация
		|	И ОтветственныеЗаОперации.Период <= &ДатаОперации
		|	И (&ДатаОперации <= КОНЕЦПЕРИОДА(ОтветственныеЗаОперации.ДатаОкончания, ДЕНЬ)
		|			ИЛИ ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Определяет ответственного за регистрацию документа в соответствии с регистром ОтветственныеЗаОперации 
//
// Параметры:
//   Организация - СправочникСсылка.Организации -  
//   ВидОперации - Строка - имя документа
//   ЦельРасчета - СправочникСсылка.ЦелиРасчета, Неопределено - если есть в реквизитах документа
//   ДатаОперации - Дата - дата операции
//   ТекущийОтветственный - СправочникСсылка.Пользователи - пользователь, который будет проверяться, может ли он быть ответственным за регистрацию операции
//
// Возвращаемое значение:
//   - СправочникСсылка.Пользователи - пользователь, ответственный за регистрацию операции
//   - Неопределено - если отвественного не удалось определить
//
Функция ОпределитьОтветственного(Организация, ВидОперации, ЦельРасчета, ДатаОперации, ТекущийОтветственный) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ДатаОперации",			ДатаОперации);
	Запрос.УстановитьПараметр("ТекущийОтветственный",	ТекущийОтветственный);
	Запрос.УстановитьПараметр("ЦельРасчета",			?(ЦельРасчета = Неопределено, Справочники.ЦелиРасчета.ПустаяСсылка(), ЦельРасчета));
	
	Если Метаданные.Документы.Найти(ВидОперации) <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперации", Документы[ВидОперации].ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	КонецЕсли;
	
	МассивТекстовЗапроса = Новый Массив;
	МассивТекстовЗапроса.Добавить(ТекстЗапроса_Используется());
	МассивТекстовЗапроса.Добавить(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОтветственныеЗаОперации.Сотрудник КАК Сотрудник,
		|	ОтветственныеЗаОперации.Сотрудник.Пользователь КАК Пользователь,
		|	ОтветственныеЗаОперации.ГруппаВидовОпераций КАК ГруппаВидовОпераций
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации КАК ОтветственныеЗаОперации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ВидыОперацийГруппы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|			ПО (ГруппыВидовОпераций.Ссылка = ВидыОперацийГруппы.Ссылка)
		|				И (ГруппыВидовОпераций.ПометкаУдаления = ЛОЖЬ)
		|		ПО (ВидыОперацийГруппы.Ссылка = ОтветственныеЗаОперации.ГруппаВидовОпераций)
		|			И (ВидыОперацийГруппы.ВидОперации = &ВидОперации)
		|			И (ВидыОперацийГруппы.ЦельРасчета = &ЦельРасчета)
		|ГДЕ
		|	ОтветственныеЗаОперации.Организация = &Организация
		|	И ОтветственныеЗаОперации.Период <= &ДатаОперации
		|	И (ОтветственныеЗаОперации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КОНЕЦПЕРИОДА(ОтветственныеЗаОперации.ДатаОкончания, ДЕНЬ) >= &ДатаОперации)
		|	И (&ОтборТекущийОтветственный
		|			ИЛИ ОтветственныеЗаОперации.Основной
		|			ИЛИ ГруппыВидовОпераций.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтветственныеЗаОперации.Основной");
	
	Запрос.Текст = СтрСоединить(МассивТекстовЗапроса, Символы.ПС + ";" + Символы.ПС);

	Если ТипЗнч(ТекущийОтветственный) = Тип("СправочникСсылка.Пользователи") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТекущийОтветственный", "ОтветственныеЗаОперации.Сотрудник.Пользователь = &ТекущийОтветственный");
		
	ИначеЕсли ТипЗнч(ТекущийОтветственный) = Тип("СправочникСсылка.Сотрудники") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТекущийОтветственный", "ОтветственныеЗаОперации.Сотрудник = &ТекущийОтветственный");
		
	Иначе	
		ВызватьИсключение "Определение ответственного вида " + ТипЗнч(ТекущийОтветственный) + " не предусмотренно";
	КонецЕсли;
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	ЕстьОтветственныеЗаОперацию	= РезультатПакета[0];
	ОтветственныйЗаОперацию		= РезультатПакета[1];
	
	Ответственный = Неопределено;	
	
	Если ЕстьОтветственныеЗаОперацию.Пустой() Тогда
		// Если по виду операции вообще нет ответственных в регистре ОтветственныеЗаОперации,
		// значит механизм ответственных по этому виду операций не реализуется 
		Ответственный = ТекущийОтветственный;	
		
	ИначеЕсли Не ОтветственныйЗаОперацию.Пустой() Тогда
		// В противном случае ответственный за операцию должен быть определен
		СтрокаОтветственныеЗаОперации = ОтветственныйЗаОперацию.Выгрузить()[0];
		
		// Проверим, есть ли замещающие сотрудники
		ЗамещающийСотрудник = РегистрыСведений.ЗамещающиеСотрудники.ЗамещающийСотрудник(СтрокаОтветственныеЗаОперации.Сотрудник, СтрокаОтветственныеЗаОперации.ГруппаВидовОпераций, ДатаОперации);
		
		Если ЗамещающийСотрудник <> Неопределено Тогда
			Если ТипЗнч(ТекущийОтветственный) = Тип("СправочникСсылка.Пользователи") Тогда
				Ответственный = ЗамещающийСотрудник.Пользователь;
			Иначе
				Ответственный = ЗамещающийСотрудник;
			КонецЕсли;
		Иначе
			Если ТипЗнч(ТекущийОтветственный) = Тип("СправочникСсылка.Пользователи") Тогда
				Ответственный = СтрокаОтветственныеЗаОперации.Пользователь;
			Иначе
				Ответственный = СтрокаОтветственныеЗаОперации.Сотрудник;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответственный;
	
КонецФункции
